[
  {
    "id": "a1",
    "slug": "sitecore-marketplace-demo-mode",
    "title": "Sitecore Marketplace – Did you already think about a Demo mode?",
    "subtitle": "Enhancing Marketplace plugins with demo mode and smart UI concepts",
    "excerpt": "Discover how to improve Sitecore Marketplace plugins with innovative demo modes, allowing marketers to preview and test apps before installation without leaving the Marketplace interface.",
    "bodyHtml": "<p class='text-lg mb-6'>Building on the power of Sitecore Marketplace and v0, this article explores the creation of a Redirect Manager plugin while introducing two groundbreaking concepts: a comprehensive summary home page and a fully functional demo mode. The demo mode enables marketers to experience plugins with realistic data and UI context before committing to installation, transforming the evaluation process. Learn how to leverage v0 for rapid UI development and implement demo modes that replicate the exact Sitecore environment across different extension points including Full Page, Sites Dashboard, and Page Builder Context.</p>",
    "author": "Christian Hahn",
    "date": "2025-09-23T00:00:00Z",
    "tags": ["Sitecore", "Marketplace", "v0", "Demo Mode", "UX"],
    "heroImage": "/images/image.png",
    "isTop": true,
    "originalUrl": "https://hachweb.wordpress.com/2025/09/23/sitecore-marketplace-did-you-already-think-about-a-demo-mode/",
    "readingTime": 8,
    "pullQuote": "Demo mode enables marketers to experience plugins with realistic data and UI context before committing to installation, transforming the evaluation process.",
    "stats": [
      { "label": "Time to Demo", "value": "< 1 min", "icon": "Clock", "trend": "-95%" },
      { "label": "Conversion Rate", "value": "+40%", "icon": "TrendingUp", "trend": "Improved" },
      { "label": "User Satisfaction", "value": "4.8/5", "icon": "Award" },
      { "label": "Preview Quality", "value": "100%", "icon": "Target", "trend": "Production" }
    ],
    "galleryImages": [
      { "src": "/images/articles/marketplace-demo-ui.jpg", "caption": "Demo Mode Interface" },
      { "src": "/images/articles/redirect-manager-preview.jpg", "caption": "Redirect Manager Demo" },
      { "src": "/images/articles/v0-generated-ui.jpg", "caption": "v0 Generated Components" }
    ],
    "keyTakeaways": [
      "Demo mode transforms the evaluation process by providing real-time previews",
      "v0 accelerates UI development from days to hours",
      "Context-aware demos replicate exact Sitecore environments",
      "Reduces installation friction and increases conversion rates"
    ],
    "technicalDetails": {
      "title": "Implementation Architecture",
      "content": "The demo mode leverages Sitecore Marketplace extension points (Full Page, Sites Dashboard, Page Builder Context) combined with v0-generated UI components. Mock data is injected at runtime to simulate production behavior without requiring installation."
    }
  },
  {
    "id": "a2",
    "slug": "v0-workflow-snippets-to-sync",
    "title": "Vercel v0 – From Snippets to Sync: Choosing the Right v0 Workflow",
    "subtitle": "Understanding different v0 workflows to maximize your productivity",
    "excerpt": "Explore the various workflows v0 offers for integrating AI-generated code into your projects, from simple copy-paste to direct GitHub synchronization, and learn when to use each approach.",
    "bodyHtml": "<p class='text-lg mb-6'>As AI-assisted development becomes mainstream, understanding how to effectively integrate v0 into your workflow is crucial. This comprehensive guide examines four distinct approaches: Copy & Paste for quick component updates, shadcn registry installation for complete app scaffolding, downloading full packages for manual control, and direct GitHub connection for continuous development cycles. Each method serves different purposes with unique advantages and trade-offs. Learn how to choose the right workflow based on your project needs, from rapid prototyping to production deployments, and discover best practices for maintaining sync between v0 and local development.</p>",
    "author": "Christian Hahn",
    "date": "2025-08-20T00:00:00Z",
    "tags": ["v0", "Vercel", "Workflow", "AI Development", "shadcn"],
    "heroImage": "/images/image.png",
    "isTop": false,
    "originalUrl": "https://hachweb.wordpress.com/2025/08/20/vercel-v0-from-snippets-to-sync-choosing-the-right-v0-workflow/",
    "readingTime": 6,
    "pullQuote": "Understanding how to effectively integrate v0 into your workflow is crucial for maximizing productivity and maintaining code quality.",
    "stats": [
      { "label": "Workflows", "value": "4 Types", "icon": "Layers" },
      { "label": "Speed Boost", "value": "5-10x", "icon": "Rocket", "trend": "Faster" },
      { "label": "Code Quality", "value": "95%", "icon": "Target", "trend": "Production-ready" },
      { "label": "Integration Time", "value": "< 5 min", "icon": "Clock" }
    ],
    "galleryImages": [
      { "src": "/images/articles/v0-copy-paste.jpg", "caption": "Copy & Paste Workflow" },
      { "src": "/images/articles/v0-shadcn-cli.jpg", "caption": "shadcn CLI Installation" },
      { "src": "/images/articles/v0-github-sync.jpg", "caption": "GitHub Integration" }
    ],
    "keyTakeaways": [
      "Copy & Paste: Best for quick component updates and iterative changes",
      "shadcn CLI: Ideal for complete app scaffolding with full project structure",
      "Download Package: Provides maximum control for manual customization",
      "GitHub Sync: Enables continuous development with version control"
    ]
  },
  {
    "id": "a3",
    "slug": "v0-first-steps-part-2",
    "title": "Vercel v0 – My very first steps into a new universe – Part 2",
    "subtitle": "Exploring the new Agent mode and its impact on development",
    "excerpt": "Discover how v0's new Agentic Mode transforms the development experience with coordinated AI agents that automatically handle planning, research, code generation, and debugging.",
    "bodyHtml": "<p class='text-lg mb-6'>The release of v0's Agentic Mode fundamentally changed the AI-assisted development landscape. Unlike the previous prompt-and-fix approach, Agentic Mode deploys coordinated AI agents that automatically handle the entire development workflow - from planning and research to code generation and debugging. This article revisits earlier v0 experiments with the new capabilities, comparing results between the old and new modes. Witness how Agent mode automatically scans for errors, suggests improvements, and refines code without manual intervention. Through practical examples including JSS Hero Banners and Page Translator components, see how the same prompts now yield more sophisticated results with enhanced attention to detail, better mock behavior, and improved UI finesse.</p>",
    "author": "Christian Hahn",
    "date": "2025-08-14T00:00:00Z",
    "tags": ["v0", "Vercel", "AI", "Agentic Mode", "Development"],
    "heroImage": "/images/image.png",
    "isTop": false,
    "originalUrl": "https://hachweb.wordpress.com/2025/08/14/vercel-v0-my-very-first-steps-into-a-new-universe-part-2/",
    "readingTime": 7,
    "pullQuote": "Agentic Mode fundamentally changed the AI-assisted development landscape by deploying coordinated AI agents that automatically handle the entire workflow.",
    "stats": [
      { "label": "Automation", "value": "90%", "icon": "Brain", "trend": "Autonomous" },
      { "label": "Code Quality", "value": "+50%", "icon": "Award", "trend": "Improved" },
      { "label": "Debug Time", "value": "-70%", "icon": "Zap", "trend": "Faster" },
      { "label": "Refinement", "value": "Auto", "icon": "Sparkles", "trend": "Intelligent" }
    ],
    "galleryImages": [
      { "src": "/images/articles/agentic-mode-workflow.jpg", "caption": "Agentic Workflow" },
      { "src": "/images/articles/auto-debugging.jpg", "caption": "Automatic Debugging" },
      { "src": "/images/articles/code-refinement.jpg", "caption": "AI Refinement" }
    ],
    "keyTakeaways": [
      "Agentic Mode coordinates multiple AI agents for complete workflows",
      "Automatic error detection and correction without manual intervention",
      "Enhanced attention to detail and UI finesse",
      "Better mock behavior and realistic component states"
    ]
  },
  {
    "id": "a4",
    "slug": "xm-cloud-dynamic-redirects-middleware",
    "title": "XM Cloud – Dynamic redirects without middleware overhead",
    "subtitle": "A hybrid approach combining CMS management with next.config performance",
    "excerpt": "Learn how to leverage CMS-managed redirects with the performance benefits of next.config.js by using Experience Edge webhooks and automated Vercel deployments.",
    "bodyHtml": "<p class='text-lg mb-6'>Traditional redirect approaches force you to choose between editor-friendly CMS management (via middleware) or developer-optimized static configuration (next.config.js). This article introduces a hybrid solution that combines the best of both worlds. By utilizing Experience Edge webhooks, Sitecore Connect, and Vercel's deployment API, you can enable marketers to manage redirects in the familiar XM Cloud interface while serving them with the performance advantages of next.config.js redirects. The approach eliminates middleware invocations on every request, reduces external API calls, and processes redirects at the CDN edge - all while maintaining dynamic CMS control. Includes implementation details for webhook configuration, Sitecore Connect recipes, and custom build-time redirect generation.</p>",
    "author": "Christian Hahn",
    "date": "2025-04-02T00:00:00Z",
    "tags": ["XM Cloud", "Next.js", "Redirects", "Performance", "Middleware"],
    "heroImage": "/images/image.png",
    "isTop": true,
    "originalUrl": "https://hachweb.wordpress.com/2025/04/02/xm-cloud-dealing-with-dynamic-redirects-and-concerned-about-middleware-invocations-and-performance-youre-in-the-right-place-to-discover-a-new-approach/",
    "readingTime": 9,
    "pullQuote": "A hybrid solution that combines editor-friendly CMS management with the performance advantages of next.config.js redirects.",
    "stats": [
      { "label": "Performance", "value": "+85%", "icon": "Rocket", "trend": "Edge CDN" },
      { "label": "Middleware Calls", "value": "0", "icon": "Activity", "trend": "Eliminated" },
      { "label": "API Latency", "value": "-100%", "icon": "Zap", "trend": "Build-time" },
      { "label": "CMS Control", "value": "100%", "icon": "Target", "trend": "Dynamic" }
    ],
    "galleryImages": [
      { "src": "/images/articles/webhook-architecture.jpg", "caption": "Webhook Setup" },
      { "src": "/images/articles/sitecore-connect-recipe.jpg", "caption": "Connect Recipe" },
      { "src": "/images/articles/vercel-deploy-api.jpg", "caption": "Auto Deployment" }
    ],
    "keyTakeaways": [
      "Experience Edge webhooks trigger automatic deployments",
      "Sitecore Connect recipes process redirect data",
      "Build-time generation creates next.config.js redirects",
      "Zero middleware overhead with full CMS management"
    ],
    "technicalDetails": {
      "title": "Webhook & Deployment Flow",
      "content": "When editors update redirects in XM Cloud, Experience Edge webhooks notify Sitecore Connect. A custom recipe fetches redirect data, generates next.config.js format, and triggers Vercel deployment API. The result: CMS-managed redirects served at CDN edge with zero runtime overhead."
    }
  },
  {
    "id": "a5",
    "slug": "v0-first-steps-part-1",
    "title": "Vercel v0 – My very first steps into a new universe – Part 1",
    "subtitle": "How v0 transformed my development workflow from hours to minutes",
    "excerpt": "Join the journey of discovering v0 and how it revolutionizes UI development for developers who struggle with design, featuring real-world examples with Sitecore and Next.js.",
    "bodyHtml": "<p class='text-lg mb-6'>As a developer with strong technical skills but limited design capabilities, v0 became a game-changing copilot. This detailed account chronicles initial experiments with v0, from generating JSS-compatible Sitecore components to building an entire Marketplace plugin UI in under 30 minutes. Learn practical lessons about prompt engineering, model selection, context management, and workflow optimization. The article demonstrates v0's ability to transform rough ideas into production-ready designs, including a complete redesign of a Page Translation plugin that went from basic to beautiful. Discover how to leverage v0 for rapid prototyping, iterate on designs through conversational refinement, and seamlessly integrate generated code into existing applications - all while achieving professional-quality results without a design background.</p>",
    "author": "Christian Hahn",
    "date": "2025-08-14T00:00:00Z",
    "tags": ["v0", "Vercel", "UI Design", "Sitecore", "Productivity"],
    "heroImage": "/images/image.png",
    "isTop": true,
    "originalUrl": "https://hachweb.wordpress.com/2025/08/14/vercel-v0-my-very-first-steps-into-a-new-universe-part-1/",
    "readingTime": 10,
    "pullQuote": "v0 became a game-changing copilot for developers with strong technical skills but limited design capabilities.",
    "stats": [
      { "label": "Development Time", "value": "-80%", "icon": "Clock", "trend": "30 min builds" },
      { "label": "Design Quality", "value": "Professional", "icon": "Award" },
      { "label": "Component Generation", "value": "100+", "icon": "Layers" },
      { "label": "Iterations", "value": "Real-time", "icon": "Sparkles", "trend": "Conversational" }
    ],
    "galleryImages": [
      { "src": "/images/articles/v0-jss-components.jpg", "caption": "JSS Components" },
      { "src": "/images/articles/marketplace-plugin-ui.jpg", "caption": "Marketplace Plugin" },
      { "src": "/images/articles/page-translation-redesign.jpg", "caption": "Before & After" }
    ],
    "keyTakeaways": [
      "Transforms rough ideas into production-ready designs",
      "Generates JSS-compatible Sitecore components",
      "Conversational iteration for design refinement",
      "No design background required for professional results"
    ]
  },
  {
    "id": "a6",
    "slug": "nextjs-app-router-routing-deep-dive",
    "title": "Exploring Next.js: The overwhelming world of routing in App Router",
    "subtitle": "Master advanced routing concepts including layouts, loading states, and parallel routes",
    "excerpt": "A comprehensive deep dive into Next.js App Router's sophisticated routing system, covering everything from basic page files to advanced concepts like route groups and parallel routes.",
    "bodyHtml": "<p class='text-lg mb-6'>Next.js App Router introduces a powerful file-based routing system that goes far beyond simple page navigation. This comprehensive guide explores the complete routing landscape, from fundamental concepts like pages and layouts to advanced patterns including nested layouts, route groups, parallel routes, and dynamic segments. Learn how to leverage special files (loading.tsx, error.tsx, not-found.tsx) to create polished user experiences with minimal code. Discover how route groups enable logical organization without affecting URLs, how parallel routes allow simultaneous rendering with independent error handling, and how dynamic routes handle wildcard content like blogs and product pages. Packed with practical examples from a real Next.js playground application, including implementations of sidebar navigation, dashboard views, and board-style layouts.</p>",
    "author": "Christian Hahn",
    "date": "2024-10-28T00:00:00Z",
    "tags": ["Next.js", "App Router", "Routing", "React", "Web Development"],
    "heroImage": "/images/image.png",
    "isTop": false,
    "originalUrl": "https://hachweb.wordpress.com/2024/10/28/exploring-next-js-the-overwhelming-world-of-routing-in-app-router/",
    "readingTime": 12,
    "pullQuote": "Next.js App Router introduces a powerful file-based routing system that goes far beyond simple page navigation.",
    "stats": [
      { "label": "Routing Features", "value": "15+", "icon": "Layers" },
      { "label": "Special Files", "value": "8 Types", "icon": "Target" },
      { "label": "Performance", "value": "Optimized", "icon": "Rocket", "trend": "Edge Ready" },
      { "label": "DX Rating", "value": "9.5/10", "icon": "Award" }
    ],
    "galleryImages": [
      { "src": "/images/articles/route-groups-structure.jpg", "caption": "Route Groups" },
      { "src": "/images/articles/parallel-routes-demo.jpg", "caption": "Parallel Routes" },
      { "src": "/images/articles/dynamic-segments.jpg", "caption": "Dynamic Routing" }
    ],
    "keyTakeaways": [
      "File-based routing with powerful conventions and special files",
      "Nested layouts enable shared UI with independent states",
      "Route groups organize without affecting URL structure",
      "Parallel routes allow simultaneous rendering with error isolation"
    ]
  },
  {
    "id": "a7",
    "slug": "ai-meets-human-connection-sitecore-symposium-2025",
    "title": "AI meets human connection at Sitecore Symposium 2025",
    "subtitle": "How SitecoreAI is reshaping digital experiences for the AI era",
    "excerpt": "Sitecore Symposium 2025 unveiled SitecoreAI, a next-generation platform that unifies content, data, and AI capabilities into a single interface designed for the age of AI-driven discovery.",
    "bodyHtml": "<p class='text-lg mb-6'>Sitecore Symposium 2025 marked a transformative moment for digital experience platforms with the announcement of SitecoreAI. This unified platform integrates Content Hub, XM Cloud, CDP, Personalize, Search, and agentic AI capabilities into a single contract with one workflow and one data model. The keynotes revealed Agentic Studio, where marketers can build and deploy AI agents within a brand-safe environment, and demonstrated live campaign creation powered by real-time insights. The event showcased how existing XM Cloud customers will automatically transition to SitecoreAI with baseline entitlements, while new features like SitecoreAI Pathway reduce migration timelines by 70%. With Sitecore Studio introducing Custom SaaS capabilities and an open marketplace for extensions, the platform empowers businesses to customize without sacrificing cloud agility. The message was clear: AI isn't replacing marketers - it's amplifying them.</p>",
    "author": "External Source",
    "date": "2025-11-06T00:00:00Z",
    "tags": ["Sitecore", "AI", "SitecoreAI", "Symposium", "Digital Experience"],
    "heroImage": "/images/image.png",
    "isTop": true,
    "originalUrl": "https://www.sitecore.com/resources/insights/digital-transformation/ai-meets-human-connection-at-sitecore-symposium-2025",
    "readingTime": 11,
    "pullQuote": "SitecoreAI marks a transformative moment - a unified platform where content, data, and AI converge into a single interface designed for AI-driven discovery.",
    "stats": [
      { "label": "Platform Unity", "value": "1 Contract", "icon": "Layers" },
      { "label": "Migration Speed", "value": "-70%", "icon": "Rocket", "trend": "AI Pathway" },
      { "label": "AI Agents", "value": "Unlimited", "icon": "Brain", "trend": "Agentic Studio" },
      { "label": "Time to Market", "value": "-60%", "icon": "Clock" }
    ],
    "galleryImages": [
      { "src": "/images/articles/sitecoreai-unified-platform.jpg", "caption": "Unified Platform" },
      { "src": "/images/articles/agentic-studio-interface.jpg", "caption": "Agentic Studio" },
      { "src": "/images/articles/sitecore-marketplace-sdk.jpg", "caption": "Marketplace & SDK" }
    ],
    "keyTakeaways": [
      "Unified platform: Content Hub + XM Cloud + CDP + Personalize + Search + AI",
      "Agentic Studio enables marketers to build AI agents in brand-safe environment",
      "Automatic transition for existing XM Cloud customers with baseline entitlements",
      "Sitecore Studio introduces Custom SaaS and open marketplace"
    ]
  }
]
